# StairsRunCenterMarkVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunCenterMarkVisible Property
ParameterTypeId Class See Also
---
"Center Mark Visible": Center Mark Visible
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunCenterMarkVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunCenterMarkVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunCenterMarkVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace